{
  /* 
    元字符: 在正则表达式中含有特殊含义的字符

    单个数字和字符的元字符
      .         匹配单个的任意字符
      []        匹配单个范围内的字符
      [0-9a-zA-Z_]   匹配单个数字/字母/下划线
      [^0-9]      匹配单个非数字字符
      \w        匹配单个数字/字母/下划线 ==> [0-9a-zA-Z_]
      \W        匹配单个非数字/字母/下划线 ==> [^0-9a-zA-Z_]
      \d        匹配单个数字字符 ==> [0-9]
      \D        匹配单个非数字字符 ==> [^0-9]

    重复字符 x(任意单个字符)
    x?   匹配0个或1个x
    x+   匹配至少一个x
    x*   匹配任意个x
    x{m,n} 匹配至少m个,至多n个x
    x{n}  必须匹配n个x

    空白字符
      \s    匹配任意单个的空白字符
      \S    匹配任意单个的非空白字符

    锚字符
      ^   行首
      $   行尾
  */

  let str = 'goo12312le'
  let reg = /goo\d{2,5}le/
  console.log(reg.test(str));


}